tap "adoptopenjdk/openjdk"
tap "codeclimate/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
brew "arrayfire"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "asdf"
brew "docutils"
brew "awscli"
brew "boost"
brew "glib"
brew "python@3.9"
brew "cgal"
brew "circleci"
brew "curl"
brew "exercism"
brew "fish"
brew "fzf"
brew "geos"
brew "krb5"
brew "libxml2"
brew "proj"
brew "libheif"
brew "libpq"
brew "netcdf"
brew "numpy"
brew "gdal"
brew "gh"
brew "git"
brew "gmailctl"
brew "unbound"
brew "gnutls"
brew "go"
brew "hub"
brew "imagemagick"
brew "jq"
brew "jsonnet"
brew "kubernetes-cli", link: false
brew "libfido2"
brew "libpqxx"
brew "lynx"
brew "mailhog"
brew "mdcat"
brew "minikube"
brew "mysql"
brew "mysql-client"
brew "neovim"
brew "netris"
brew "nghttp2"
brew "node"
brew "openjdk"
brew "python-tabulate"
brew "pgcli"
brew "pinentry-mac"
brew "poppler-qt5"
brew "postgresql@14", restart_service: true
brew "sfcgal"
brew "postgis"
brew "postgresql@10"
brew "postgresql@12", restart_service: true
brew "python@3.10"
brew "tcl-tk", link: false
brew "python@3.8"
brew "ranger"
brew "rcm"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "starship"
brew "tmux"
brew "typescript"
brew "wget"
brew "zellij"
brew "codeclimate/formulae/codeclimate", link: false
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "1password"
cask "adoptopenjdk8"
cask "alacritty"
cask "alfred"
cask "altair-graphql-client"
cask "chromedriver"
cask "dash"
cask "evernote"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "graphiql"
cask "kitty"
cask "lastpass"
cask "messenger"
cask "ngrok"
cask "opera"
cask "postman"
cask "rectangle"
cask "session-manager-plugin"
cask "todoist"
cask "toggl-track"
cask "tuple"
cask "virtualbox"
cask "vivaldi"
cask "whatsapp"
