tap "adoptopenjdk/openjdk"
tap "ankitpokhrel/jira-cli"
tap "codeclimate/formulae"
tap "dracula/install"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "lokalise/cli-2"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
brew "openssl@3"
brew "python@3.12"
brew "arrayfire"
brew "coreutils"
brew "libyaml"
brew "asdf"
brew "python@3.11"
brew "awscli"
brew "boost-python3"
brew "cgal"
brew "circleci"
brew "cmake"
brew "qemu"
brew "colima"
brew "curl"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docutils"
brew "exercism"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "geos"
brew "gnupg"
brew "proj"
brew "libheif"
brew "libpq"
brew "netcdf"
brew "numpy", link: false
brew "poppler"
brew "gdal"
brew "gh"
brew "git"
brew "git-crypt"
brew "gitleaks"
brew "glow"
brew "gmailctl"
brew "go"
brew "grip"
brew "hivemind"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "jsonnet"
brew "kubernetes-cli", link: false
brew "lastpass-cli"
brew "libpqxx"
brew "lynx"
brew "mailhog"
brew "make"
brew "mdcat"
brew "memcached"
brew "minikube"
brew "mise"
brew "mupdf"
brew "mysql"
brew "mysql-client"
brew "neovim"
brew "netris"
brew "nghttp2"
brew "node"
brew "openjdk"
brew "tmux"
brew "overmind"
brew "pgcli"
brew "pinentry-mac"
brew "poppler-qt5"
brew "postgresql@14", restart_service: true
brew "sfcgal"
brew "postgis"
brew "postgresql@12", restart_service: true
brew "postgrest"
brew "python-tabulate"
brew "python@3.10"
brew "tcl-tk", link: false
brew "python@3.8"
brew "python@3.9"
brew "rabbitmq"
brew "ranger"
brew "rcm"
brew "redis", restart_service: true
brew "ripgrep"
brew "shunit2"
brew "sqlfluff"
brew "starship"
brew "tmuxinator"
brew "typescript"
brew "universal-ctags"
brew "vips"
brew "watchman"
brew "wget"
brew "yarn"
brew "yq"
brew "zellij"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "lokalise/cli-2/lokalise2"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "brave-browser"
cask "brewlet"
cask "chatgpt"
cask "dash"
cask "discord"
cask "dracula-xcode"
cask "evernote"
cask "flotato"
cask "font-commit-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fragment-mono"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "keybase"
cask "kitty"
cask "messenger"
cask "miro"
cask "obsidian"
cask "postman"
cask "pushplaylabs-sidekick"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "thunderbird"
cask "todoist"
cask "ukelele"
cask "whatsapp"
cask "xquartz"
